In this project we'll perform SVM Classification on a famous Titanic Dataset.
Let's get aboard and see why good and healthy lifestyle could tip the scales towards favourable outcome (ofc...unless someone's having suicidal thoughts) in life-death situations.

In [1]:
#import all the important libraries
import pandas as pd
import numpy as np
from sklearn.svm import SVC 
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [2]:
#load in the data
#We've to perform split on the data.
df = pd.read_excel("titanic.xlsx")
#Replace all the NaN with 0.
df = df.fillna(0)
train, test = train_test_split(df, test_size = 0.2)

Remember: I've replaced 0 -> Female and 1 -> male

In [3]:
train.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
355,2,1,"Buss, Miss. Kate",0,36.0,0,0,27849,13.0000,0,S,9,0.0,"Sittingbourne, England / San Diego, CA"
1175,3,0,"Sage, Miss. Stella Anna",0,0.0,8,2,CA. 2343,69.5500,0,S,0,0.0,0
491,2,0,"Malachard, Mr. Noel",1,0.0,0,0,237735,15.0458,D,C,0,0.0,Paris
1132,3,0,"Plotcharsky, Mr. Vasil",1,0.0,0,0,349227,7.8958,0,S,0,0.0,0
1058,3,0,"Nieminen, Miss. Manta Josefina",0,29.0,0,0,3101297,7.9250,0,S,0,0.0,0

In [4]:
test.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
435,2,0,"Hart, Mr. Benjamin",1,43.0,1,1,F.C.C. 13529,26.2500,0,S,0,0.0,"Ilford, Essex / Winnipeg, MB"
329,2,1,"Angle, Mrs. William A (Florence ""Mary"" Agnes H...",0,36.0,1,0,226875,26.0000,0,S,11,0.0,"Warwick, England"
584,2,1,"Webber, Miss. Susan",0,32.5,0,0,27267,13.0000,E101,S,12,0.0,"England / Hartford, CT"
1222,3,0,"Stankovic, Mr. Ivan",1,33.0,0,0,349239,8.6625,0,C,0,0.0,0
474,2,0,"Kvillner, Mr. Johan Henrik Johannesson",1,31.0,0,0,C.A. 18723,10.5000,0,S,0,165.0,"Sweden / Arlington, NJ"

In [5]:
#data ka shape dekh liya jaae
print("Training Data Shape:", train.shape)
#data ka shape dekh liya jaae
print("Testing Data Shape:", test.shape)

Training Data Shape: (1047, 14)
Testing Data Shape: (262, 14)

In [6]:
#Separation of independent and target variable on training data.
train_x = train.drop(columns=["survived", "name", "home.dest", "cabin", "embarked", "ticket", "boat", "body"], axis=1)
train_y = train["survived"]
#Separation of independent and target variable on testing data.
test_x = test.drop(columns=["survived", "name", "home.dest", "cabin", "embarked", "ticket", "boat", "body"], axis=1)
test_y = test["survived"]

In [7]:
train_x.head()

      pclass  sex   age  sibsp  parch     fare
355        2    0  36.0      0      0  13.0000
1175       3    0   0.0      8      2  69.5500
491        2    1   0.0      0      0  15.0458
1132       3    1   0.0      0      0   7.8958
1058       3    0  29.0      0      0   7.9250

In [8]:
#fit the model -> basically ek object initialise kar rhe h abhi yahaa
model = SVC()
model.fit(train_x, train_y)

SVC()

In [9]:
#Prediction of target on train dataset
predict_train = model.predict(train_x)
print("Target on train data", predict_train)

Target on train data [0 0 0 ... 0 0 1]

In [10]:
#Accuracy Score on train dataset
acc_train = accuracy_score(train_y, predict_train)
print("Accuracy Score on Train Dataset: ", acc_train)

Accuracy Score on Train Dataset:  0.6800382043935053

In [11]:
#Prediction of target on test dataset
predict_test = model.predict(test_x)
print("Target on test data: ", predict_test)

Target on test data:  [0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 1 0 0 0 1 0 0 0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 1 0
 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0
 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 1 1 0 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0
 0 0 0 0 0 1 0 0 0 0 0 0 1 0 0 0 0 1 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1
 0 0 1]

In [12]:
#Accuracy Score on test datatset
acc_test = accuracy_score(test_y, predict_test)
print("Accuracy Score on Test Dataset: ", acc_test)

Accuracy Score on Test Dataset:  0.683206106870229